онфигурация/Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалоговаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодУКТЗЕД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетАкцизнуюМарку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентНаценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФОП</Name>
					<Comment>Физическое лицо предприниматель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФОП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Штрихкоды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Штрихкод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

онфигурация/Catalogs/Номенклатура/Ext/ObjectModule.bsl
// =============================================================================
// МОДУЛЬ ОБЪЕКТА: Справочник Номенклатура
// =============================================================================

Процедура ПередЗаписью(Отказ)
	
	// [Spec-First 1.1] Автозаполнение Артикула из Кода
	// Если артикул пустой, заполняем его из кода, убирая ведущие нули
	// ВАЖНО: Артикул доступен только для элементов, а не для групп!
	Если НЕ ЭтоГруппа И ПустаяСтрока(Артикул) И ЗначениеЗаполнено(Код) Тогда
		Артикул = УбратьВедущиеНули(Код);
	КонецЕсли;
	
	// [Spec-First 1.2] Автозаполнение ПроцентНаценки из группы-родителя
	// Если элемент новый (или наценка не задана) и есть родительская группа —
	// берём наценку из группы, чтобы не задавать её вручную каждый раз
	Если НЕ ЭтоГруппа И ПроцентНаценки = 0 И ЗначениеЗаполнено(Родитель) Тогда
		ЗаполнитьНаценкуИзГруппы();
	КонецЕсли;
	
	// Проверка уникальности штрихкодов внутри табличной части
	ПроверитьУникальностьШтрихкодовВТЧ(Отказ);
	
КонецПроцедуры

Процедура ПослеЗаписи(Отказ)
	
	// Синхронизация штрихкодов с регистром сведений происходит на форме
	// Здесь можно добавить дополнительную логику при необходимости
	
КонецПроцедуры

#Область СлужебныеПроцедурыИФункции

// Автоматически заполняет ПроцентНаценки из родительской группы номенклатуры.
// Ищет первую группу в иерархии родителей, у которой заполнена наценка.
// Если наценка найдена — устанавливает её в текущем объекте.
//
Процедура ЗаполнитьНаценкуИзГруппы()
	
	ТекущийРодитель = Родитель;
	
	Пока ЗначениеЗаполнено(ТекущийРодитель) Цикл
		
		НаценкаГруппы = ТекущийРодитель.ПроцентНаценки;
		
		Если НаценкаГруппы <> 0 Тогда
			ПроцентНаценки = НаценкаГруппы;
			Возврат;
		КонецЕсли;
		
		// Поднимаемся выше по иерархии
		ТекущийРодитель = ТекущийРодитель.Родитель;
		
	КонецЦикла;
	
КонецПроцедуры

// Добавляет штрихкод к номенклатуре с проверкой уникальности
//
// Параметры:
//  Номенклатура - СправочникСсылка.Номенклатура - Элемент номенклатуры
//  Штрихкод - Строка - Значение штрихкода
//
// Возвращаемое значение:
//  Булево - Истина, если штрихкод успешно добавлен; Ложь - если пара уже существует
//
Функция ЗаполнитьШтрихкод(Номенклатура, Штрихкод) Экспорт
	
	// Проверка входных параметров
	Если Не ЗначениеЗаполнено(Номенклатура) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ПустаяСтрока(СокрЛП(Штрихкод)) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ШтрихкодНормализованный = ВРег(СокрЛП(Штрихкод));
	
	// Проверка существования пары номенклатура-штрихкод в регистре сведений
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Штрихкоды.Номенклатура КАК Номенклатура
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	|ГДЕ
	|	ВЕРХРЕГ(Штрихкоды.Штрихкод) = &Штрихкод
	|	И Штрихкоды.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Штрихкод", ШтрихкодНормализованный);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Результат = Запрос.Выполнить();
	
	// Если пара уже существует, возвращаем Ложь
	Если Не Результат.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Проверка, не привязан ли штрихкод к другой номенклатуре
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Штрихкоды.Номенклатура КАК Номенклатура
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	|ГДЕ
	|	ВЕРХРЕГ(Штрихкоды.Штрихкод) = &Штрихкод
	|	И Штрихкоды.Номенклатура <> &Номенклатура";
	
	Запрос.УстановитьПараметр("Штрихкод", ШтрихкодНормализованный);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатПроверки = Запрос.Выполнить();
	
	Если Не РезультатПроверки.Пустой() Тогда
		
		Выборка = РезультатПроверки.Выбрать();
		Выборка.Следующий();
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон(
			"Штрихкод ""%1"" уже привязан к номенклатуре ""%2""!",
			Штрихкод,
			Выборка.Номенклатура);
		Сообщение.Сообщить();
		
		Возврат Ложь;
		
	КонецЕсли;
	
	// Добавление записи в регистр сведений
	НаборЗаписей = РегистрыСведений.Штрихкоды.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Штрихкод.Установить(ШтрихкодНормализованный);
	НаборЗаписей.Отбор.Номенклатура.Установить(Номенклатура);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Штрихкод = ШтрихкодНормализованный;
	НоваяЗапись.Номенклатура = Номенклатура;
	
	Попытка
		НаборЗаписей.Записать();
		Возврат Истина;
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон(
			"Ошибка при добавлении штрихкода ""%1"": %2",
			Штрихкод,
			ОписаниеОшибки());
		Сообщение.Сообщить();
		
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

Функция УбратьВедущиеНули(Строка)
	
	// Удаляет ведущие нули из строки
	// Пример: "000123" -> "123", "00ABC" -> "ABC"
	
	Если ПустаяСтрока(Строка) Тогда
		Возврат "";
	КонецЕсли;
	
	Результат = СокрЛП(Строка);
	
	// Убираем ведущие нули
	Пока СтрНачинаетсяС(Результат, "0") И СтрДлина(Результат) > 1 Цикл
		Результат = Сред(Результат, 2);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура ПроверитьУникальностьШтрихкодовВТЧ(Отказ)
	
	// Проверка на дублирование штрихкодов внутри табличной части
	СписокШтрихкодов = Новый Соответствие;
	
	Для Каждого СтрокаТЧ Из Штрихкоды Цикл
		
		// Пропускаем пустые штрихкоды
		Если ПустаяСтрока(СокрЛП(СтрокаТЧ.Штрихкод)) Тогда
			Продолжить;
		КонецЕсли;
		
		Штрихкод = ВРег(СокрЛП(СтрокаТЧ.Штрихкод));
		
		// Проверяем дубликаты внутри ТЧ
		Если СписокШтрихкодов[Штрихкод] <> Неопределено Тогда
			
			Отказ = Истина;
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон(
				"Штрихкод ""%1"" дублируется в табличной части!",
				СокрЛП(СтрокаТЧ.Штрихкод));
			Сообщение.Сообщить();
			
			Возврат;
			
		КонецЕсли;
		
		СписокШтрихкодов.Вставить(Штрихкод, Истина);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
